In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('2018_citywide_sale.csv')

In [6]:
df.head()

,BOROUGH,BUILDING CLASS CATEGORY,Unnamed: 2,Unnamed: 3,NUMBER OF SALES,MINIMUM SALE PRICE,AVERAGE SALE PRICE,MEDIAN SALE PRICE,MAXIMUM SALE PRICE
0,Manhattan,01 ONE FAMILY HOMES,NaN,NaN,89,200000.0,8235346.0,6350000.0,41000000.0
1,Manhattan,02 TWO FAMILY HOMES,NaN,NaN,74,424797.0,5620562.0,3725000.0,43500000.0
2,Manhattan,03 THREE FAMILY HOMES,NaN,NaN,40,816425.0,5684533.0,2965000.0,27400000.0
3,Bronx,01 ONE FAMILY HOMES,NaN,NaN,970,200000.0,499060.0,425000.0,12303058.0
4,Bronx,02 TWO FAMILY HOMES,NaN,NaN,1409,200000.0,523501.0,512000.0,5400000.0